Tekla Open API Reference for Tekla Structures 2025
SurfaceObject Properties
The SurfaceObject type exposes the following members.
Properties
Name | Description
Class
 Gets or sets the class of the surface object.
CreateHoles
 Gets or sets a value indicating whether CreateHoles parameter of the surface object.
Father
 Gets or sets the father object of the surface object. The father can be set only before the Insert(), otherwise exception is thrown.
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
Name
 Gets or sets the name of the surface object.
Polymesh
 Gets or sets the surface geometry brep.
Type
 Gets or sets the type of the surface object.
Top
See Also
Reference
SurfaceObject Class
Tekla.Structures.Model Namespace